In [1]:
import pandas as pd
names = ['Bob', 'Jessica', 'Mary', 'John', 'Mel']
births = [968, 155, 77, 578, 973]
custom = [1, 5, 25, 13, 23232]
BabyDataSet = list(zip(names, births))
df = pd.DataFrame(data = BabyDataSet, columns = ['Names', 'Births'])

In [2]:
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [3]:
df.head

<bound method NDFrame.head of      Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973>

In [4]:
df.dtypes

Names     object
Births     int64
dtype: object

In [5]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
df.columns

Index(['Names', 'Births'], dtype='object')

In [8]:
df[df['Births']>100]

     Names  Births
0      Bob     968
1  Jessica     155
3     John     578
4      Mel     973

In [11]:
df.mean()

C:\Users\infan\AppData\Local\Temp/ipykernel_27484/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Births    550.2
dtype: float64

In [12]:
import numpy as np

In [23]:
data11 = pd.DataFrame(np.arange(16).reshape(4,4),
                      index =['tomato', 'banana', 'orange', 'apple'],
                      columns = ['one', 'two', 'three', 'four'])

In [24]:
data11

        one  two  three  four
tomato    0    1      2     3
banana    4    5      6     7
orange    8    9     10    11
apple    12   13     14    15

In [25]:
data11.loc['banana', ['two', 'three']]

two      5
three    6
Name: banana, dtype: int32

In [26]:
data11.iloc[2, [0,1,3]]

one      8
two      9
four    11
Name: orange, dtype: int32

In [27]:
df['Names']

0        Bob
1    Jessica
2       Mary
3       John
4        Mel
Name: Names, dtype: object

In [28]:
for aa in zip(names, births):
    print(aa)

('Bob', 968)
('Jessica', 155)
('Mary', 77)
('John', 578)
('Mel', 973)